In [1]:
import pandas as pd
import numpy as np
import psycopg2
from sqlalchemy import create_engine
import datetime
import re
from config import db_pwd

## import the 3 BB csv sets

In [2]:
bb_miss_df = pd.read_csv("../Resources/msd_bb_non_matches.csv")
bb_miss_df.head()

,Unnamed: 0,msd_id,echo_nest_id,artist,title,year
0,0,TRMMMYQ128F932D901,SOQMMHC12AB0180CB8,Faster Pussy cat,Silent Night,2003
1,1,TRMMMBB12903CB7D21,SOEYRFT12AB018936C,Kris Kross,2 Da Beat Ch'yall,1993
2,2,TRMMMNS128F93548E1,SOYGNWH12AB018191E,3 Gars Su'l Sofa,L'antarctique,2007
3,3,TRMMMXJ12903CBF111,SOLJTLX12AB01890ED,Jorge Negrete,El hijo del pueblo,1997
4,4,TRMMMKI128F931D80D,SOSDCFG12AB0184647,Lena Philipsson,006,1998

In [3]:
bb_hit_df = pd.read_csv("../Resources/msd_bb_matches.csv")
bb_hit_df.head()

,Unnamed: 0,msd_id,echo_nest_id,artist,title,year,peak,weeks
0,0,TRMMWJS12903CBB7F5,SOLBDWO12AB0188CC2,Aerosmith,Remember (Walking In The Sand),1979,6,67
1,1,TRMMCDR128F423AB03,SOSZNRJ12A8AE46E38,Michael Cera & Ellen Page,Anyone Else But You,2007,2,91
2,2,TRMMRUB12903CA097C,SOGDEWJ12AB0184C06,Brook Benton,Lie To Me,1986,10,13
3,4,TRMMFIS128E078EDEA,SOYURIX12A6701E960,Aerosmith,Cryin',1993,26,12
4,7,TRMMNZH128F92CF7D0,SOXCAWC12A8C144428,Buster Brown,Sugar Babe,2002,2,99

In [4]:
# I added "engine='python" because of error UnicodeDecodeError: 'utf-8' codec can't decode byte 0x92 in position 2
# https://stackoverflow.com/questions/18171739/unicodedecodeerror-when-reading-csv-file-in-pandas-with-python
songs_rank_df = pd.read_csv("../Resources/songs_1970_2018_uniq.csv", engine='python')
songs_rank_df.head()

,date,title,artist,peakPos,lastPos,weeks,rank,change
0,6/21/18,4th Dimension,KIDS SEE GHOSTS Featuring Louis Prima,42,0,1,42,New
1,6/21/18,All Girls Are The Same,Juice WRLD,41,49,5,41,8
2,6/21/18,All Mine,Kanye West,11,11,2,31,-20
3,6/21/18,Alone,Halsey Featuring Big Sean & Stefflon Don,70,73,9,74,-1
4,6/21/18,Babe,Sugarland Featuring Taylor Swift,72,0,2,95,Re-Entry

In [5]:
# Drop columns 
songs_rank_df = songs_rank_df.drop(columns= ["peakPos","lastPos","change"],axis=1)
songs_rank_df.head()

,date,title,artist,weeks,rank
0,6/21/18,4th Dimension,KIDS SEE GHOSTS Featuring Louis Prima,1,42
1,6/21/18,All Girls Are The Same,Juice WRLD,5,41
2,6/21/18,All Mine,Kanye West,2,31
3,6/21/18,Alone,Halsey Featuring Big Sean & Stefflon Don,9,74
4,6/21/18,Babe,Sugarland Featuring Taylor Swift,2,95

In [6]:
# Extract year from date column
songs_rank_df["year"] = pd.DatetimeIndex(songs_rank_df['date']).year
songs_rank_df = songs_rank_df.drop(["date"],axis=1)
songs_rank_df.head()

,title,artist,weeks,rank,year
0,4th Dimension,KIDS SEE GHOSTS Featuring Louis Prima,1,42,2018
1,All Girls Are The Same,Juice WRLD,5,41,2018
2,All Mine,Kanye West,2,31,2018
3,Alone,Halsey Featuring Big Sean & Stefflon Don,9,74,2018
4,Babe,Sugarland Featuring Taylor Swift,2,95,2018

In [7]:
# Rename columns and add successful column
songs_rank_df =songs_rank_df.rename(columns= {"rank":"peak"})
songs_rank_df["Successful"] = 1
songs_rank_df.head()

,title,artist,weeks,peak,year,Successful
0,4th Dimension,KIDS SEE GHOSTS Featuring Louis Prima,1,42,2018,1
1,All Girls Are The Same,Juice WRLD,5,41,2018,1
2,All Mine,Kanye West,2,31,2018,1
3,Alone,Halsey Featuring Big Sean & Stefflon Don,9,74,2018,1
4,Babe,Sugarland Featuring Taylor Swift,2,95,2018,1

In [8]:
# Change the order of columns
songs_rank_df = songs_rank_df[["artist","title","year","Successful", "weeks", "peak"]]
songs_rank_df.sort_values(by="year")

,artist,title,year,Successful,weeks,peak
15368,Bobby Bloom,Montego Bay,1970,1,16,27
7253,Fantasy,Stoned Cowboy,1970,1,11,80
7252,Jake Holmes,So Close,1970,1,11,57
7251,Ann Peebles,Part Time Love,1970,1,11,64
7250,The Klowns,Lady Love,1970,1,2,95
...,...,...,...,...,...,...
248,Miguel Featuring Travis Scott,Sky Walker,2018,1,26,50
249,Khalid,Young Dumb & Broke,2018,1,36,46
250,Lil Yachty Featuring Trippie Redd,66,2018,1,1,73
241,Jacquees X Dej Loaf,At The Club,2018,1,7,96
0,KIDS SEE GHOSTS Featuring Louis Prima,4th Dimension,2018,1,1,42

In [9]:
bb_miss_df.head()

,Unnamed: 0,msd_id,echo_nest_id,artist,title,year
0,0,TRMMMYQ128F932D901,SOQMMHC12AB0180CB8,Faster Pussy cat,Silent Night,2003
1,1,TRMMMBB12903CB7D21,SOEYRFT12AB018936C,Kris Kross,2 Da Beat Ch'yall,1993
2,2,TRMMMNS128F93548E1,SOYGNWH12AB018191E,3 Gars Su'l Sofa,L'antarctique,2007
3,3,TRMMMXJ12903CBF111,SOLJTLX12AB01890ED,Jorge Negrete,El hijo del pueblo,1997
4,4,TRMMMKI128F931D80D,SOSDCFG12AB0184647,Lena Philipsson,006,1998

In [10]:
# Add Successful column to tables bb_miss_df, and drop unnecessary columns
bb_miss_df["Successful"] = 0
bb_miss_df = bb_miss_df.drop(columns=["Unnamed: 0", "echo_nest_id"], axis=1)
bb_miss_df.head()

               msd_id            artist               title  year  Successful
0  TRMMMYQ128F932D901  Faster Pussy cat        Silent Night  2003           0
1  TRMMMBB12903CB7D21        Kris Kross   2 Da Beat Ch'yall  1993           0
2  TRMMMNS128F93548E1  3 Gars Su'l Sofa       L'antarctique  2007           0
3  TRMMMXJ12903CBF111     Jorge Negrete  El hijo del pueblo  1997           0
4  TRMMMKI128F931D80D   Lena Philipsson                 006  1998           0

In [11]:
# Add Successful column to tables to bb_hit_df, and drop unnecessary columns
bb_hit_df["Successful"] = 1
bb_hit_df = bb_hit_df.drop(columns=["Unnamed: 0", "echo_nest_id"], axis=1)
bb_hit_df.head()

,msd_id,artist,title,year,peak,weeks,Successful
0,TRMMWJS12903CBB7F5,Aerosmith,Remember (Walking In The Sand),1979,6,67,1
1,TRMMCDR128F423AB03,Michael Cera & Ellen Page,Anyone Else But You,2007,2,91,1
2,TRMMRUB12903CA097C,Brook Benton,Lie To Me,1986,10,13,1
3,TRMMFIS128E078EDEA,Aerosmith,Cryin',1993,26,12,1
4,TRMMNZH128F92CF7D0,Buster Brown,Sugar Babe,2002,2,99,1

In [12]:
# Connect the two BB dataframes with Ids
# 2 dataframes: bb_df: with id, and songs_rank_df: without any id
# we're still applying the same regex to both dataframes
bb_df = pd.concat([bb_hit_df,bb_miss_df])
bb_df.head()

,msd_id,artist,title,year,peak,weeks,Successful
0,TRMMWJS12903CBB7F5,Aerosmith,Remember (Walking In The Sand),1979,6.0,67.0,1
1,TRMMCDR128F423AB03,Michael Cera & Ellen Page,Anyone Else But You,2007,2.0,91.0,1
2,TRMMRUB12903CA097C,Brook Benton,Lie To Me,1986,10.0,13.0,1
3,TRMMFIS128E078EDEA,Aerosmith,Cryin',1993,26.0,12.0,1
4,TRMMNZH128F92CF7D0,Buster Brown,Sugar Babe,2002,2.0,99.0,1

In [13]:
# Get null values
bb_df.isnull().sum()
bb_df = bb_df.fillna(0)

In [14]:
bb_df.shape

(95067, 7)

In [15]:
# lower case artist and title columns - Postgres doesn't deal well with capitalized letters
bb_df['artist'] = bb_df['artist'].str.lower()
bb_df['title'] = bb_df['title'].str.lower()
bb_df.head()

,msd_id,artist,title,year,peak,weeks,Successful
0,TRMMWJS12903CBB7F5,aerosmith,remember (walking in the sand),1979,6.0,67.0,1
1,TRMMCDR128F423AB03,michael cera & ellen page,anyone else but you,2007,2.0,91.0,1
2,TRMMRUB12903CA097C,brook benton,lie to me,1986,10.0,13.0,1
3,TRMMFIS128E078EDEA,aerosmith,cryin',1993,26.0,12.0,1
4,TRMMNZH128F92CF7D0,buster brown,sugar babe,2002,2.0,99.0,1

In [16]:
songs_rank_df['artist'] = songs_rank_df['artist'].str.lower()
songs_rank_df['title'] = songs_rank_df['title'].str.lower()
songs_rank_df.head()

,artist,title,year,Successful,weeks,peak
0,kids see ghosts featuring louis prima,4th dimension,2018,1,1,42
1,juice wrld,all girls are the same,2018,1,5,41
2,kanye west,all mine,2018,1,2,31
3,halsey featuring big sean & stefflon don,alone,2018,1,9,74
4,sugarland featuring taylor swift,babe,2018,1,2,95

In [17]:
# Create regex to find "Featuring" artists
feat_string = r'\s[f][e][a][t][u][r][e][s].+$|\s[f][e][a][t][u][r][i][n][g].+$|\s[f][e][a][t]\..+$'

In [18]:
# Apply formatting/removing to title column 
bb_df['title'] = bb_df['title'].str.replace(r'\([^\(\)]+\)', '', regex=True) #(...)
bb_df['title'] = bb_df['title'].str.replace(r'\[[^\[\]]+\]', '', regex=True) #[...] 
bb_df['title'] = bb_df['title'].str.replace(r'\s-.+', '', regex=True) # -...
bb_df['title'] = bb_df['title'].str.replace(r'\s&.+', '', regex=True)  # &...
bb_df['title'] = bb_df['title'].str.replace(feat_string, '', regex=True) # feat...
bb_df['title'] = bb_df['title'].str.replace(r'\/.+', '', regex=True) # /...
bb_df['title'] = bb_df['title'].str.replace(r'\\.+', '', regex=True) # \...
bb_df['title'] = bb_df['title'].str.replace(r';.+', '',  regex=True) # ;...
bb_df['title'] = bb_df['title'].str.replace(r'_.+', '',  regex=True) # _...
bb_df['title'] = bb_df['title'].str.replace(r'\s\s+', ' ',  regex=True ) # more than one blank space into one
bb_df['title'] = bb_df['title'].str.replace(r'^\s+', '', regex=True) # blank spaces at begiining
bb_df['title'] = bb_df['title'].str.replace(r'\s+$', '', regex=True) # blank spaces at end

In [19]:
# Apply same formatting/removing to artist column 
bb_df['artist'] = bb_df['artist'].str.replace(r'\([^\(\)]+\)', '', regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(r'\[[^\[\]]+\]', '', regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(r'\s-.+', '', regex=True) 
bb_df['artist'] = bb_df['artist'].str.replace(r'\s&.+', '', regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(feat_string, '', regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(r'\/.+', '', regex=True) 
bb_df['artist'] = bb_df['artist'].str.replace(r'\\.+', '', regex=True) 
bb_df['artist'] = bb_df['artist'].str.replace(r';.+', '',  regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(r'_.+', '',  regex=True) 
bb_df['artist'] = bb_df['artist'].str.replace(r'\s\s+', ' ',  regex=True )
bb_df['artist'] = bb_df['artist'].str.replace(r'^\s+', '', regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(r'\s+$', '', regex=True)
bb_df['artist'] = bb_df['artist'].str.replace(r'"', '', regex=True) # remove "" in artist name

In [20]:
bb_df.head(20)

,msd_id,artist,title,year,peak,weeks,Successful
0,TRMMWJS12903CBB7F5,aerosmith,remember,1979,6.0,67.0,1
1,TRMMCDR128F423AB03,michael cera,anyone else but you,2007,2.0,91.0,1
2,TRMMRUB12903CA097C,brook benton,lie to me,1986,10.0,13.0,1
3,TRMMFIS128E078EDEA,aerosmith,cryin',1993,26.0,12.0,1
4,TRMMNZH128F92CF7D0,buster brown,sugar babe,2002,2.0,99.0,1
5,TRMMPDJ128F429472E,little river band,help is on its way,1980,22.0,14.0,1
6,TRMMUIL128F1463720,eric clapton,after midnight,1970,12.0,18.0,1
7,TRMMEWQ128F4292A1F,lou reed,walk on the wild side,1972,14.0,16.0,1
8,TRMMDVB12903CE2FF6,craig morgan,redneck yacht club,2005,19.0,45.0,1
9,TRMWMQX12903CC07B9,thelma houston,don't leave me this way,1976,24.0,1.0,1
10,TRMWMAY128F42895B1,eddy arnold,make the world go away,1965,14.0,6.0,1
11,TRMWWHN128F426758F,atlanta rhythm section,spooky,1983,14.0,17.0,1
12,TRMWWOG128F9312B0F,wayne newton,years,1990,13.0,35.0,1
13,TRMWGCP128F145841D,maxi priest,wild world,1987,18.0,25.0,1
14,TRMWBBX128F930100E,jody reynolds,endless sleep,1958,6.0,17.0,1
15,TRMWQWJ128F425A43C,annie lennox,why,1992,20.0,34.0,1
16,TRMWZVX12903CE4EE3,the troggs,wild thing,1966,11.0,1.0,1
17,TRMWTDT128F9341FB2,foo fighters,doa,2005,12.0,68.0,1
18,TRMWUXD128E0794FA9,sting,englishman in new york,1987,4.0,84.0,1
19,TRMWJGD128F14570E2,helen reddy,ain't no way to treat a lady,1987,16.0,8.0,1

In [21]:
# Apply formatting/removing to title column 
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\([^\(\)]+\)', '', regex=True) #(...)
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\[[^\[\]]+\]', '', regex=True) #[...] 
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\s-.+', '', regex=True) # -...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\s&.+', '', regex=True)  # &...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(feat_string, '', regex=True) # feat...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\/.+', '', regex=True) # /...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\\.+', '', regex=True) # \...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r';.+', '',  regex=True) # ;...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'_.+', '',  regex=True) # _...
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\s\s+', ' ',  regex=True ) # more than one blank space into one
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'^\s+', '', regex=True) # blank spaces at begiining
songs_rank_df['title'] = songs_rank_df['title'].str.replace(r'\s+$', '', regex=True) # blank spaces at end

In [22]:
# Apply same formatting/removing to artist column 
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\([^\(\)]+\)', '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\[[^\[\]]+\]', '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\s-.+', '', regex=True) 
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\s&.+', '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(feat_string, '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\/.+', '', regex=True) 
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\\.+', '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r';.+', '',  regex=True) # ;...
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'_.+', '',  regex=True) # _...
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\s\s+', ' ',  regex=True )
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'^\s+', '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'\s+$', '', regex=True)
songs_rank_df['artist'] = songs_rank_df['artist'].str.replace(r'"', '', regex=True) # remove "

In [23]:
songs_rank_df.head()

            artist                   title  year  Successful  weeks  peak
0  kids see ghosts           4th dimension  2018           1      1    42
1       juice wrld  all girls are the same  2018           1      5    41
2       kanye west                all mine  2018           1      2    31
3           halsey                   alone  2018           1      9    74
4        sugarland                    babe  2018           1      2    95

In [24]:
songs_rank_df.shape

(20108, 6)

In [25]:
# test: if same song/artist/year, only keep highest "succesful", highest "weeks", lowest "peak"
test_dico = [{"artist": "artist1", "title": "title1", "year": "2020", "Successful": 1, "weeks": 2, "peak": 20},
             {"artist": "artist2", "title": "title1", "year": "2020", "Successful": 1, "weeks": 2, "peak": 20},
             {"artist": "artist1", "title": "title1", "year": "2020", "Successful": 1, "weeks": 8, "peak": 5},
             {"artist": "artist2", "title": "title1", "year": "2020", "Successful": 1, "weeks": 42, "peak": 1},
            ]

In [26]:
test=pd.DataFrame(test_dico)
test

    artist   title  year  Successful  weeks  peak
0  artist1  title1  2020           1      2    20
1  artist2  title1  2020           1      2    20
2  artist1  title1  2020           1      8     5
3  artist2  title1  2020           1     42     1

In [27]:
test = test.groupby(["artist", "title", "year"]).agg({"Successful": "max", "weeks": "max", "peak": "min"})
print(test)

                     Successful  weeks  peak
artist  title  year
artist1 title1 2020           1      8     5
artist2 title1 2020           1     42     1

In [28]:
test=test.reset_index()
test

    artist   title  year  Successful  weeks  peak
0  artist1  title1  2020           1      8     5
1  artist2  title1  2020           1     42     1

In [29]:
# delete doubles and keep the highest "successful", highest "weeks" and lowest "peak" values
songs_rank_df = songs_rank_df.groupby(["artist", "title", "year"]).agg({"Successful": "max", "weeks": "max", "peak": "min"})
songs_rank_df = songs_rank_df.reset_index()
songs_rank_df

        artist                          title  year  Successful  weeks  peak
0               when your heart stops beating  2006           1      1    89
1      'n sync      a little more time on you  1999           1     22    44
2      'n sync                    bye bye bye  2000           1     23    40
3      'n sync                     girlfriend  2002           1     20    43
4      'n sync                           gone  2002           1     24    40
...        ...                            ...   ...         ...    ...   ...
19615   zz top              sharp dressed man  1983           1      9    96
19616   zz top                   sleeping bag  1986           1     17    82
19617   zz top                         stages  1986           1     12    75
19618   zz top                           tush  1975           1      9    42
19619   zz top                     velcro fly  1986           1     12    96

[19620 rows x 6 columns]

In [30]:
new_column_names = {"msd_id": "track_id",
                    "artist": "artist_name",
                    "title": "song_title",
                    "year": "song_year",
                    "Successful": "target_success",
                    "weeks": "target_weeks",
                    "peak": "target_peak" 
}

In [31]:
bb_df = bb_df.rename(columns = new_column_names)
bb_df.head()

,track_id,artist_name,song_title,song_year,target_peak,target_weeks,target_success
0,TRMMWJS12903CBB7F5,aerosmith,remember,1979,6.0,67.0,1
1,TRMMCDR128F423AB03,michael cera,anyone else but you,2007,2.0,91.0,1
2,TRMMRUB12903CA097C,brook benton,lie to me,1986,10.0,13.0,1
3,TRMMFIS128E078EDEA,aerosmith,cryin',1993,26.0,12.0,1
4,TRMMNZH128F92CF7D0,buster brown,sugar babe,2002,2.0,99.0,1

In [32]:
max(bb_df.artist_name.apply(len))

63

In [33]:
songs_rank_df = songs_rank_df.rename(columns = new_column_names)
songs_rank_df.head()

,artist_name,song_title,song_year,target_success,target_weeks,target_peak
0,,when your heart stops beating,2006,1,1,89
1,'n sync,a little more time on you,1999,1,22,44
2,'n sync,bye bye bye,2000,1,23,40
3,'n sync,girlfriend,2002,1,20,43
4,'n sync,gone,2002,1,24,40

In [34]:
max(songs_rank_df.artist_name.apply(len))

84

In [35]:
songs_rank_df.isnull().sum()

artist_name       0
song_title        0
song_year         0
target_success    0
target_weeks      0
target_peak       0
dtype: int64

In [36]:
bb_df.shape

(95067, 7)

In [37]:
songs_rank_df.shape

(19620, 6)

## export to Postgres - create tables "bb_id" and "bb_no_id" in Postgres first

In [38]:
# Connect to database (Note: The package psychopg2 is required for Postgres to work with SQLAlchemy)
db_string = f"postgres://postgres:{db_pwd}@127.0.0.1:5432/Platinum_Lyrics"

engine = create_engine(db_string)

In [39]:
for ind in range(0,19):
    songs_rank_df[ind*1000:ind*1000+1000].to_sql(name='bb_no_id', con=engine, index=False, 
          if_exists='append')
    print(f"Chunk {ind*1000}-{ind*1000+1000} exported")
    print("---------------------")

songs_rank_df[19000:19621].to_sql(name='bb_no_id', con=engine, index=False, if_exists='append') 
print(f"Chunk 19000-19622 exported")

print("Export Successful")

Chunk 0-1000 exported
---------------------
Chunk 1000-2000 exported
---------------------
Chunk 2000-3000 exported
---------------------
Chunk 3000-4000 exported
---------------------
Chunk 4000-5000 exported
---------------------
Chunk 5000-6000 exported
---------------------
Chunk 6000-7000 exported
---------------------
Chunk 7000-8000 exported
---------------------
Chunk 8000-9000 exported
---------------------
Chunk 9000-10000 exported
---------------------
Chunk 10000-11000 exported
---------------------
Chunk 11000-12000 exported
---------------------
Chunk 12000-13000 exported
---------------------
Chunk 13000-14000 exported
---------------------
Chunk 14000-15000 exported
---------------------
Chunk 15000-16000 exported
---------------------
Chunk 16000-17000 exported
---------------------
Chunk 17000-18000 exported
---------------------
Chunk 18000-19000 exported
---------------------
Chunk 19000-19622 exported
Export Successful

In [40]:
for ind in range(0,95):
    bb_df[ind*1000:ind*1000+1000].to_sql(name='bb_id', con=engine, index=False, 
          if_exists='append')
    print(f"Chunk {ind*1000}-{ind*1000+1000} exported")
    print("---------------------")

bb_df[95000:95068].to_sql(name='bb_id', con=engine, index=False, if_exists='append') 
print(f"Chunk 95000-95068 exported")

print("Export Successful")

Chunk 0-1000 exported
---------------------
Chunk 1000-2000 exported
---------------------
Chunk 2000-3000 exported
---------------------
Chunk 3000-4000 exported
---------------------
Chunk 4000-5000 exported
---------------------
Chunk 5000-6000 exported
---------------------
Chunk 6000-7000 exported
---------------------
Chunk 7000-8000 exported
---------------------
Chunk 8000-9000 exported
---------------------
Chunk 9000-10000 exported
---------------------
Chunk 10000-11000 exported
---------------------
Chunk 11000-12000 exported
---------------------
Chunk 12000-13000 exported
---------------------
Chunk 13000-14000 exported
---------------------
Chunk 14000-15000 exported
---------------------
Chunk 15000-16000 exported
---------------------
Chunk 16000-17000 exported
---------------------
Chunk 17000-18000 exported
---------------------
Chunk 18000-19000 exported
---------------------
Chunk 19000-20000 exported
---------------------
Chunk 20000-21000 exported
---------------------
Chunk 21000-22000 exported
---------------------
Chunk 22000-23000 exported
---------------------
Chunk 23000-24000 exported
---------------------
Chunk 24000-25000 exported
---------------------
Chunk 25000-26000 exported
---------------------
Chunk 26000-27000 exported
---------------------
Chunk 27000-28000 exported
---------------------
Chunk 28000-29000 exported
---------------------
Chunk 29000-30000 exported
---------------------
Chunk 30000-31000 exported
---------------------
Chunk 31000-32000 exported
---------------------
Chunk 32000-33000 exported
---------------------
Chunk 33000-34000 exported
---------------------
Chunk 34000-35000 exported
---------------------
Chunk 35000-36000 exported
---------------------
Chunk 36000-37000 exported
---------------------
Chunk 37000-38000 exported
---------------------
Chunk 38000-39000 exported
---------------------
Chunk 39000-40000 exported
---------------------
Chunk 40000-41000 exported
---------------------
Chunk 41000-42000 exported
---------------------
Chunk 42000-43000 exported
---------------------
Chunk 43000-44000 exported
---------------------
Chunk 44000-45000 exported
---------------------
Chunk 45000-46000 exported
---------------------
Chunk 46000-47000 exported
---------------------
Chunk 47000-48000 exported
---------------------
Chunk 48000-49000 exported
---------------------
Chunk 49000-50000 exported
---------------------
Chunk 50000-51000 exported
---------------------
Chunk 51000-52000 exported
---------------------
Chunk 52000-53000 exported
---------------------
Chunk 53000-54000 exported
---------------------
Chunk 54000-55000 exported
---------------------
Chunk 55000-56000 exported
---------------------
Chunk 56000-57000 exported
---------------------
Chunk 57000-58000 exported
---------------------
Chunk 58000-59000 exported
---------------------
Chunk 59000-60000 exported
---------------------
Chunk 60000-61000 exported
---------------------
Chunk 61000-62000 exported
---------------------
Chunk 62000-63000 exported
---------------------
Chunk 63000-64000 exported
---------------------
Chunk 64000-65000 exported
---------------------
Chunk 65000-66000 exported
---------------------
Chunk 66000-67000 exported
---------------------
Chunk 67000-68000 exported
---------------------
Chunk 68000-69000 exported
---------------------
Chunk 69000-70000 exported
---------------------
Chunk 70000-71000 exported
---------------------
Chunk 71000-72000 exported
---------------------
Chunk 72000-73000 exported
---------------------
Chunk 73000-74000 exported
---------------------
Chunk 74000-75000 exported
---------------------
Chunk 75000-76000 exported
---------------------
Chunk 76000-77000 exported
---------------------
Chunk 77000-78000 exported
---------------------
Chunk 78000-79000 exported
---------------------
Chunk 79000-80000 exported
---------------------
Chunk 80000-81000 exported
---------------------
Chunk 81000-82000 exported
---------------------
Chunk 82000-83000 exported
---------------------
Chunk 83000-84000 exported
---------------------
Chunk 84000-85000 exported
---------------------
Chunk 85000-86000 exported
---------------------
Chunk 86000-87000 exported
---------------------
Chunk 87000-88000 exported
---------------------
Chunk 88000-89000 exported
---------------------
Chunk 89000-90000 exported
---------------------
Chunk 90000-91000 exported
---------------------
Chunk 91000-92000 exported
---------------------
Chunk 92000-93000 exported
---------------------
Chunk 93000-94000 exported
---------------------
Chunk 94000-95000 exported
---------------------
Chunk 95000-95068 exported
Export Successful